"""7) Дана целочисленная квадратная матрица. Найти в каждой строке наибольший элемент
и поменять его местами с элементом главной диагонали. """

matrix = [ [1, 2, 3],
           [6, 5, 4],
           [9, 8, 7] ]

print(my_list)
