"""
1) Дан список целых чисел.
Создать новый список, каждый элемент которого равен исходному элементу
умноженному на -2
"""

first_list = [1, 2, 3, 4, 5, 6, 7, 8]
print([num * -2 for num in first_list])