# Создать строку равную введённой строке без последних двух символов

print(input("Введите вашу строку: ")[:-2])
