# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

x = float(input("Ввведите первое вещественное число: "))
y = float(input("Ввведите второе вещественное число: "))

print("Сумма", x + y)
print("Разность", x - y)
print("Произведение", x * y)