# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

x = float(input("Введите первое вещественное число: "))
y = float(input("Введите второе вещественное число: "))

print("Сумма", x + y)
print("Разность", x - y)
print("Произведение", x * y)
