# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

x = float(input("Ввведите первое вещественное число: "))
y = float(input("Ввведите второе вещественное число: "))

print("Среднее арифметическое",  (x+y)/2)
print("Среднее геометрическое",  (x*y)**0.5)