# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

x, y = map(float, input("Введите x и y через пробел: ").split())

print("Сумма", x + y)
print("Разность", x - y)
print("Произведение", x * y)
