# Создать строку равную предпоследнему символу введенной строки.

string = input("Введите вашу строку: ")
print(string[-1])
