# Создать строку равную введенной строкe без последних двух символов.

string = input("Введите вашу строку: ")
print(string[:-2])
