# Создать строку равную третьему символу введенной строки

string = input("Введите вашу строку: ")
print(string[2])
