# Создать строку равную первым пяти символам введенной строки.

string = input("Введите вашу строку: ")
print(string[:5])
