# 3) Дан словарь: {'test': 'test_value', 'europe': 'eur', 'dollar': 'usd', 'ruble': 'rub'}
# Добавить каждому ключу число равное длине этого ключа 
# (пример {‘key’: ‘value’} -> {‘key3’:‘value’}). Чтобы получить список
#  ключей - использовать метод .keys()

my_dict = {'test': 'test_value', 'europe': 'eur', 'dollar': 'usd', 'ruble': 'rub'}

for items in my_dict:
    
    print(items)

print (my_dict)