# 1. Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

a = float(input('enter float numbes '))
b = float(input('enter float numbes '))

sum_=a+b
raz=a-b
pr=a*b
print(sum_, raz, pr)

#. Даны действительные числа x и y. Получить |x| -|y| / 1+|y|

